{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Hey",
        "Good morning",
        "Good afternoon",
        "Good evening"
      ],
      "responses": [
        "Hello! I'm Rohan's AI assistant. How can I help you explore his portfolio?",
        "Hi there! What would you like to know about Rohan?",
        "Greetings! Feel free to ask me about Rohan's skills, projects, or experience."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "Goodbye", "See you later", "Thanks, bye"],
      "responses": [
        "Goodbye! Feel free to return if you have more questions.",
        "See you around! Have a great day.",
        "Bye! Thanks for stopping by."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "Appreciate it", "Many thanks"],
      "responses": [
        "You're welcome!",
        "Happy to help!",
        "No problem!",
        "Glad I could assist."
      ]
    },
    {
      "tag": "name",
      "patterns": [
        "What is your name?",
        "Who are you?",
        "What should I call you?"
      ],
      "responses": [
        "I am Rohan's AI assistant, here to help you navigate his portfolio.",
        "You can call me Rohan's assistant. I'm powered by AI.",
        "I'm an AI assistant created to answer questions about Rohan's work."
      ]
    },
    {
      "tag": "about_rohan",
      "patterns": [
        "Tell me about Rohan",
        "Who is Rohan?",
        "What does Rohan do?",
        "Rohan's background",
        "About Rohan",
        "What are his achievements?",
        "What has he achieved?"
      ],
      "responses": [
        "Rohan is an AI/ML engineer specializing in deep learning and computer vision. He's passionate about building intelligent systems and solving complex problems with elegant software solutions.",
        "Rohan Purohit is a dedicated Software & AI Engineer with expertise in machine learning, computer vision, and full-stack development. He focuses on turning intricate challenges into robust software solutions.",
        "Rohan is a Software & AI Engineer who leverages deep learning and computer vision to create impactful projects. He's driven by curiosity and a desire to build innovative technology."
      ]
    },
    {
      "tag": "skills",
      "patterns": [
        "What are Rohan's skills?",
        "What technologies does Rohan know?",
        "What programming languages does Rohan use?",
        "Rohan's expertise",
        "What is he good at?",
        "Skills"
      ],
      "responses": [
        "Rohan's core skills include Deep Learning, Computer Vision, and Neural Networks. He's proficient in frameworks like TensorFlow, Keras, PyTorch, and Scikit-learn, and languages such as Python, C++, and JavaScript. He also has strong web development skills including React and Streamlit. [cite: 1, 6, 11, 16, 21, 26, 31, 36, 41, 46, 51, 56, 61]",
        "He has expertise in Python, C/C++, JavaScript, React, TensorFlow, Keras, PyTorch, OpenCV, and more. He's adept at various aspects of AI/ML, web development, and software engineering. [cite: 1, 6, 11, 16, 21, 26, 31, 36, 41, 46, 51, 56, 61]",
        "Rohan is skilled in Core AI/ML Concepts (Deep Learning, Computer Vision), Frameworks & Libraries (TensorFlow, PyTorch, OpenCV), Web Development (React, JavaScript), and Languages & Tools (Python, C++, Docker, SQL). [cite: 1, 6, 11, 16, 21, 26, 31, 36, 41, 46, 51, 56, 61]"
      ]
    },
    {
      "tag": "projects",
      "patterns": [
        "Tell me about his projects",
        "What projects has Rohan worked on?",
        "Can you list Rohan's projects?",
        "Projects",
        "Show me his work"
      ],
      "responses": [
        "Rohan has worked on several key projects, including a Military Drone Detection System, Pneumonia Detection from X-Rays, an AI-Based Image Downloader, and his Personal Portfolio Website. You can explore them in detail in the Projects section. [cite: 1, 11, 21, 31]",
        "His portfolio showcases projects in computer vision, medical diagnostics, AI tools, and web development. Each project demonstrates his ability to apply advanced AI/ML and software engineering skills. [cite: 1, 11, 21, 31]",
        "You can find detailed information on Rohan's projects in the dedicated 'Projects' section of his portfolio. They range from drone detection to NLP applications. [cite: 1, 11, 21, 31]"
      ]
    },
    {
      "tag": "web_development_projects",
      "patterns": [
        "Any web development projects?",
        "Has Rohan done any projects on web development?",
        "Does Rohan have experience with front-end development?",
        "Web projects"
      ],
      "responses": [
        "Yes, Rohan built his Personal Portfolio Website using React, JavaScript, and modern CSS, which includes an AI chatbot. He also developed an AI-Based Image Downloader using Streamlit, demonstrating his web application development skills. [cite: 11, 31]",
        "Rohan's web development experience includes building interactive user interfaces with React and creating data-driven web applications using Streamlit. His own portfolio is a prime example of his front-end skills. [cite: 11, 31]",
        "He has strong web development skills, showcased by his portfolio website and AI-based tools developed with frameworks like React and Streamlit. [cite: 11, 31]"
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "How can I contact Rohan?",
        "Rohan's email",
        "Contact information",
        "Reach out to Rohan"
      ],
      "responses": [
        "You can find Rohan's contact information and a direct contact form in the 'Contact' section of this portfolio.",
        "Feel free to use the contact form on his website or connect with him via the social links provided.",
        "All contact details are available on the 'Contact' page."
      ]
    },
    {
      "tag": "certifications",
      "patterns": [
        "certifications",
        "certified",
        "What certifications does Rohan have?",
        "List his certificates"
      ],
      "responses": [
        "He holds two key certifications: \n\n* **Data Structures in C++** from Coding Ninjas.\n* **Natural Language Processing with Classification and Vector Spaces** from DeepLearning.AI and Coursera."
      ]
    },
    {
      "tag": "no_match",
      "patterns": [],
      "responses": [
        "I'm sorry, I don't understand that. Please try asking a question about Rohan's skills, projects, or certifications.",
        "I'm not sure what you're asking. Can you rephrase your question about Rohan's portfolio?",
        "My apologies, I can only provide information related to Rohan's professional work. Please ask about his skills, projects, or background."
      ]
    }
  ]
}
